## Overview

In [2]:
import pandas as pd

In [4]:
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)

df

# 테이블에 데이터를 저장하기 위해서는 DataFrame 생성
# list안에 dictonary가 있을 시 key가 column head가 되고, list의 형태로 된 valuesms DataFrame의 각 column의 값이 된다

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [9]:
pd.DataFrame(
"Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
"Age": [22, 35, 58],
"Sex": ["male", "male", "female"]
)

SyntaxError: invalid syntax (530617710.py, line 2)